In [1]:
import pandas as pd

In [2]:
import numpy as np

In [55]:
data = {
    'ID':[1,2,3,4,5],
    'Name':['Aniruddha', 'Vaibhav', 'Kartavya', 'Dnyanesh', 'Amol'],
    'Math':[85, 90, np.nan, 66, 125],
    'Science':[78, 88, 92, None, 65],
    'English':[80, 85, 70, 60, 75],
    'Attendance':[0.92, 0.85, 0.95, 0.40, 1.10]
}

In [56]:
print(data)

{'ID': [1, 2, 3, 4, 5], 'Name': ['Aniruddha', 'Vaibhav', 'Kartavya', 'Dnyanesh', 'Amol'], 'Math': [85, 90, nan, 66, 125], 'Science': [78, 88, 92, None, 65], 'English': [80, 85, 70, 60, 75], 'Attendance': [0.92, 0.85, 0.95, 0.4, 1.1]}

In [57]:
df = pd.DataFrame(data)

In [58]:
print(df)

   ID       Name   Math  Science  English  Attendance
0   1  Aniruddha   85.0     78.0       80        0.92
1   2    Vaibhav   90.0     88.0       85        0.85
2   3   Kartavya    NaN     92.0       70        0.95
3   4   Dnyanesh   66.0      NaN       60        0.40
4   5       Amol  125.0     65.0       75        1.10

In [59]:
df.isnull().sum()

ID            0
Name          0
Math          1
Science       1
English       0
Attendance    0
dtype: int64

In [60]:
df.dtypes

ID              int64
Name           object
Math          float64
Science       float64
English         int64
Attendance    float64
dtype: object

In [61]:
df.duplicated().sum()

np.int64(0)

In [62]:
df.describe

<bound method NDFrame.describe of    ID       Name   Math  Science  English  Attendance
0   1  Aniruddha   85.0     78.0       80        0.92
1   2    Vaibhav   90.0     88.0       85        0.85
2   3   Kartavya    NaN     92.0       70        0.95
3   4   Dnyanesh   66.0      NaN       60        0.40
4   5       Amol  125.0     65.0       75        1.10>

In [63]:
df.loc[len(df)] = df.loc[1]

In [64]:
df

   ID       Name   Math  Science  English  Attendance
0   1  Aniruddha   85.0     78.0       80        0.92
1   2    Vaibhav   90.0     88.0       85        0.85
2   3   Kartavya    NaN     92.0       70        0.95
3   4   Dnyanesh   66.0      NaN       60        0.40
4   5       Amol  125.0     65.0       75        1.10
5   2    Vaibhav   90.0     88.0       85        0.85

In [65]:
df[df.duplicated(subset=['Math'])]

   ID     Name  Math  Science  English  Attendance
5   2  Vaibhav  90.0     88.0       85        0.85

In [66]:
df = df.drop_duplicates()

In [67]:
df

   ID       Name   Math  Science  English  Attendance
0   1  Aniruddha   85.0     78.0       80        0.92
1   2    Vaibhav   90.0     88.0       85        0.85
2   3   Kartavya    NaN     92.0       70        0.95
3   4   Dnyanesh   66.0      NaN       60        0.40
4   5       Amol  125.0     65.0       75        1.10

In [68]:
df['Math'] = df['Math'].fillna(df['Math'].mean())

C:\Users\HARDWARELAB\AppData\Local\Temp\ipykernel_9424\1038178227.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Math'] = df['Math'].fillna(df['Math'].mean())

In [69]:
df

   ID       Name   Math  Science  English  Attendance
0   1  Aniruddha   85.0     78.0       80        0.92
1   2    Vaibhav   90.0     88.0       85        0.85
2   3   Kartavya   91.5     92.0       70        0.95
3   4   Dnyanesh   66.0      NaN       60        0.40
4   5       Amol  125.0     65.0       75        1.10

In [70]:
df['Science'] = df['Science'].fillna(df['Science'].median())

C:\Users\HARDWARELAB\AppData\Local\Temp\ipykernel_9424\368293247.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Science'] = df['Science'].fillna(df['Science'].median())

In [71]:
df

   ID       Name   Math  Science  English  Attendance
0   1  Aniruddha   85.0     78.0       80        0.92
1   2    Vaibhav   90.0     88.0       85        0.85
2   3   Kartavya   91.5     92.0       70        0.95
3   4   Dnyanesh   66.0     83.0       60        0.40
4   5       Amol  125.0     65.0       75        1.10

In [72]:
def attend(x):
    return min(x, 1)

df['Attendance'] = df['Attendance'].apply(attend)

C:\Users\HARDWARELAB\AppData\Local\Temp\ipykernel_9424\3976859995.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Attendance'] = df['Attendance'].apply(attend)

In [73]:
df

   ID       Name   Math  Science  English  Attendance
0   1  Aniruddha   85.0     78.0       80        0.92
1   2    Vaibhav   90.0     88.0       85        0.85
2   3   Kartavya   91.5     92.0       70        0.95
3   4   Dnyanesh   66.0     83.0       60        0.40
4   5       Amol  125.0     65.0       75        1.00

In [74]:
df['Math'] = df['Math'].apply(lambda x: min(x, 100))

C:\Users\HARDWARELAB\AppData\Local\Temp\ipykernel_9424\1324181280.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Math'] = df['Math'].apply(lambda x: min(x, 100))

In [75]:
df

   ID       Name   Math  Science  English  Attendance
0   1  Aniruddha   85.0     78.0       80        0.92
1   2    Vaibhav   90.0     88.0       85        0.85
2   3   Kartavya   91.5     92.0       70        0.95
3   4   Dnyanesh   66.0     83.0       60        0.40
4   5       Amol  100.0     65.0       75        1.00

In [76]:
df['Math'].min()

np.float64(66.0)

In [77]:
df['Math_log']=np.log(df['Math'])

C:\Users\HARDWARELAB\AppData\Local\Temp\ipykernel_9424\1209941809.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Math_log']=np.log(df['Math'])

In [78]:
df

   ID       Name   Math  Science  English  Attendance  Math_log
0   1  Aniruddha   85.0     78.0       80        0.92  4.442651
1   2    Vaibhav   90.0     88.0       85        0.85  4.499810
2   3   Kartavya   91.5     92.0       70        0.95  4.516339
3   4   Dnyanesh   66.0     83.0       60        0.40  4.189655
4   5       Amol  100.0     65.0       75        1.00  4.605170